# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

# import random
# len_array = int(input())
# n = int(input())
# x = int(input())
# list_numb = []
# for i in range(len_array):
#     list_numb.append(random.randint(1,n))
# print(list_numb)

# count = 0
# for i in list_numb:
#     if i == x:
#         count += 1
# print(f'Number {x} meeting in array {count} ')

# Задача 18: Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai
# . Последняя строка
# содержит число X
# 5
# 1 2 3 4 5
# 6
# -> 5


# import random
# len_array = int(input())
# n = int(input())
# x = int(input())
# list_numb = []
# for i in range(len_array):
#     list_numb.append(random.randint(1,n))
# print(list_numb)

# closest = list_numb[0]
# difference = abs(list_numb[0] - x)

# for i in list_numb:
#     if abs (i-x) < difference:
#         difference = abs (i-x)
#         closest = i
# print(f'Ближайшее к числу х = {x} число в масиве {closest} ')


# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.

# *Пример:*

# ноутбук
#     12

n = input()

# cost = {1: set('AEIOULNSTRАВЕИНОРСТ'),
#         2: set('DGДКЛМПУ'),
#         3: set('BCMPБГЁЬЯ'),
#         4: set('FHVWYЙЫ'),
#         5: set('KЖЗХЦЧ'),
#         8: set('JXШЭЮ'),
#         10: set('QZФЩЪ'),
#         0: set(' ')
#         }

cost = dict([(1, 'AEIOULNSTRАВЕИНОРСТ'),
            (2, 'DGДКЛМПУ'),
            (3, 'BCMPБГЁЬЯ'),
            (4, 'FHVWYЙЫ'),
            (5, 'KЖЗХЦЧ'),
            (8, 'JXШЭЮ'),
            (10,'QZФЩЪ')])

count = 0
for i in n:
    for k in cost:
        if i.upper() in cost[k]:
            count += k

print(count)
